Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Conforming to ExpressibleByStringLiteral
ja: ExpressibleByStringLiteralに準拠する

source: Conforming to ExpressibleByUnicodeScalarLiteral
ja: ExpressibleByUnicodeScalarLiteralに準拠する

source: Conforming to the Equatable and Hashable protocols is straightforward and makes it easier to use your own types in Swift.
ja: EquatableとHashableプロトコルに準拠することは、あなた独自の型をSwiftで使うのをわかりやすいそしてより容易なものにします。

source: Conforming to the AdditiveArithmetic Protocol
ja: AdditiveArithmeticプロトコルに準拠する

source: Conforming to the BidirectionalCollection Protocol
ja: BidirectionalCollectionプロトコルへの準拠

source: Conforming to the CaseIterable Protocol
ja: CaseIterableプロトコルに準拠する

source: Conforming to the Collection Protocol
ja: Collectionプロトコルに準拠する

source: Conforming to the Comparable Protocol
ja: Comparableプロトコルに準拠する

source: Conforming to the CustomDebugStringConvertible Protocol
ja: CustomDebugStringConvertibleプロトコルに準拠する

source: Conforming to the CustomPlaygroundDisplayConvertible Protocol
ja: CustomPlaygroundDisplayConvertibleプロトコルに準拠する

source: Conforming to the CustomStringConvertible Protocol
ja: CustomStringConvertibleプロトコルに準拠する

source: Conforming to the Equatable Protocol
ja: Equatableプロトコルに準拠する

source: Conforming to the ExpressibleByDictionaryLiteral Protocol
ja: ExpressibleByDictionaryLiteralプロトコルに準拠する

source: Conforming to the FixedWidthInteger Protocol
ja: FixedWidthIntegerプロトコルに準拠する

source: Conforming to the Hashable Protocol
ja: Hashableプロトコルに準拠する

source: Conforming to the Identifiable Protocol
ja: Identifiableプロトコルに準拠する

source: Conforms To
ja: 次に準拠

source: Conforms when A conforms to Equatable and B conforms to Equatable.
ja: AがEquatableに準拠するそしてBがEquatableに準拠する時に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, C conforms to Equatable, D conforms to Equatable, E conforms to Equatable, F conforms to Equatable, G conforms to Equatable, and H conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、CがEquatableに準拠する、DがEquatableに準拠する、EがEquatableに準拠する、FがEquatableに準拠する、GがEquatableに準拠する、そしてHがEquatableに準拠する時に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, C conforms to Equatable, D conforms to Equatable, E conforms to Equatable, F conforms to Equatable, and G conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、CがEquatableに準拠する、DがEquatableに準拠する、EがEquatableに準拠する、FがEquatableに準拠する、そしてGがEquatableに準拠する時に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, C conforms to Equatable, D conforms to Equatable, E conforms to Equatable, and F conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、CがEquatableに準拠する、DがEquatableに準拠する、EがEquatableに準拠する、そしてFがEquatableに準拠する時に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, C conforms to Equatable, D conforms to Equatable, and E conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、CがEquatableに準拠する、DがEquatableに準拠する、そしてEがEquatableに準拠する時に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, C conforms to Equatable, and D conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、CがEquatableに準拠する、そしてDがEquatableに準拠する場合に準拠します。

source: Conforms when A conforms to Equatable, B conforms to Equatable, and C conforms to Equatable.
ja: AがEquatableに準拠する、BがEquatableに準拠する、そしてCがEquatableに準拠する時に利用可能です。

source: Conforms when Base conforms to BidirectionalCollection and Base.Index conforms to Hashable.
ja: BaseがBidirectionalCollectionに準拠するそしてBase.IndexがHashableに準拠する時に準拠します。

source: Conforms when Base conforms to BidirectionalCollection.
ja: BaseがBidirectionalCollectionに準拠する時に準拠します。

source: Conforms when Base conforms to Collection and Base.Index conforms to Hashable.
ja: BaseがCollectionに準拠するそしてBase.IndexがHashableに準拠する時に準拠します。

source: Conforms when Base conforms to Collection, Base.Element conforms to Collection, Base.Index conforms to Hashable, and Base.Element.Index conforms to Hashable.
ja: BaseがCollectionに準拠する、Base.ElementがCollectionに準拠する、Base.IndexがHashableに準拠する、そしてBase.Element.IndexがHashableに準拠する時に準拠します。

source: Conforms when Bound conforms to Decodable.
ja: BoundがDecodableに準拠する時に準拠します。

source: Conforms when Bound conforms to Encodable.
ja: BoundがEncodableに準拠する時に準拠します。

source: Conforms when Bound conforms to Hashable, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがHashableに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に準拠します。

source: Conforms when Bound conforms to Hashable.
ja: BoundがHashableに準拠する時に準拠します。

source: Conforms when Bound conforms to Strideable and Bound.Stride conforms to SignedInteger.
ja: BoundがStrideableに準拠するそしてBound.StrideがSignedIntegerに準拠する時に準拠します。

source: Conforms when Bound is Int.
ja: BoundがIntである時に準拠します。

source: Conforms when ChangeElement conforms to Decodable and Encodable.
ja: ChangeElementがDecodableとEncodableに準拠する時に準拠します。

source: Conforms when ChangeElement conforms to Equatable.
ja: ChangeElementがEquatableに準拠する時に準拠します。

source: Conforms when ChangeElement conforms to Hashable.
ja: ChangeElementがHashableに準拠する時に準拠します。

source: Conforms when Content conforms to Equatable and Modifier conforms to Equatable.
ja: ContentがEquatableに準拠するそしてModifierがEquatableに準拠する時に準拠します。

source: Conforms when Element conforms to CKRecordValueProtocol.
ja: ElementがCKRecordValueProtocolに準拠する時に準拠します。

source: Conforms when Element conforms to Decodable.
ja: ElementがDecodableに準拠している時に準拠します。

source: Conforms when Element conforms to DecodableWithConfiguration.
ja: ElementがDecodableWithConfigurationに準拠している時に準拠します。

source: Conforms when Element conforms to Encodable.
ja: ElementがEncodableに準拠する時に準拠します。

source: Conforms when Element conforms to EncodableWithConfiguration.
ja: ElementがEncodableWithConfigurationに準拠している時に準拠します。

source: Conforms when Element conforms to Equatable.
ja: ElementがEquatableに準拠する時に準拠します。

source: Conforms when Element conforms to Hashable.
ja: ElementがHashableに準拠する時に準拠します。

source: Conforms when Element conforms to MLDataValueConvertible.
ja: ElementがMLDataValueConvertibleに準拠する時に準拠します。

source: Conforms when Element is UInt8.
ja: ElementがUInt8である場合に準拠します。

source: Conforms when Elements conforms to BidirectionalCollection.
ja: ElementsがBidirectionalCollectionに準拠する時に準拠します。

source: Conforms when Elements conforms to Equatable.
ja: ElementsがEquatableに準拠する時に準拠します。

source: Conforms when Failure conforms to Decodable.
ja: FailureがDecodableに準拠する時に準拠します。

source: Conforms when Failure conforms to Encodable.
ja: FailureがEncodableに準拠する時に準拠します。

source: Conforms when Failure conforms to Equatable.
ja: FailureがEquatableに準拠する時に準拠します。

source: Conforms when Failure conforms to Hashable.
ja: FailureがHashableに準拠する時に準拠します。

source: Conforms when First conforms to Gesture, Second conforms to Gesture, First.Value conforms to Equatable, and Second.Value conforms to Equatable.
ja: FirstがGestureに準拠する、SecondがGestureに準拠する、First.ValueがEquatableに準拠する、そしてSecond.ValueがEquatableに準拠する時に準拠します。

source: Conforms when First conforms to Gesture, Second conforms to Gesture, First.Value conforms to Hashable, and Second.Value conforms to Hashable.
ja: FirstがGestureに準拠する、SecondがGestureに準拠する、First.ValueがHashableに準拠する、そしてSecond.ValueがHashableに準拠する時に準拠します。

source: Conforms when ID conforms to Hashable.
ja: IDがHashableに準拠する時に準拠します。

source: Conforms when Key conforms to Decodable and Value conforms to Decodable.
ja: KeyがDecodableに準拠するそしてValueがDecodableに準拠する時に準拠します。

source: Conforms when Key conforms to Encodable and Value conforms to Encodable.
ja: KeyがEncodableに準拠するそしてValueがEncodableに準拠する時に準拠します。

source: Conforms when Key conforms to MLDataValueConvertible and Value conforms to MLDataValueConvertible.
ja: KeyがMLDataValueConvertibleに準拠するそしてValueがMLDataValueConvertibleに準拠する時に準拠します。

source: Conforms when MusicItemType conforms to Decodable.
ja: MusicItemTypeがDecodableに準拠している時に準拠します。

source: Conforms when MusicItemType conforms to Encodable.
ja: MusicItemTypeがEncodableに準拠している時に準拠します。

source: Conforms when MusicItemType conforms to Equatable.
ja: MusicItemTypeがEquatableに準拠している時に準拠します。

source: Conforms when MusicItemType conforms to Hashable.
ja: MusicItemTypeがHashableに準拠している時に準拠します。

source: Conforms when Output conforms to Decodable, Output conforms to Encodable, Failure conforms to Decodable, Failure conforms to Encodable, and Failure conforms to Error.
ja: OutputがDecodableに準拠する、OutputがEncodableに準拠する、FailureがDecodableに準拠する、FailureがEncodableに準拠する、そしてFailureがErrorに準拠する時に準拠します。

source: Conforms when Output conforms to Decodable, Output conforms to Encodable, Failure conforms to Decodable, and Failure conforms to Encodable.
ja: OutputがDecodableに準拠する、OutputがEncodableに準拠する、FailureがDecodableに準拠する、そしてFailureがEncodableに準拠する時に準拠します。

source: Conforms when Output conforms to Equatable.
ja: OutputがEquatableに準拠する時に準拠します。

source: Conforms when Prefix conforms to Equatable and Suffix conforms to Equatable.
ja: PrefixがEquatableに準拠するそしてSuffixがEquatableに準拠する時に準拠します。

source: Conforms when SignedType conforms to CustomDebugStringConvertible.
ja: SignedTypeがCustomDebugStringConvertibleに準拠する時に準拠します。

source: Conforms when SignedType conforms to Equatable.
ja: SignedTypeがEquatableに準拠している時に準拠します。

source: Conforms when SignedType conforms to Hashable.
ja: SignedTypeがHashableに準拠している時に準拠します。

source: Conforms when Success conforms to Equatable and Failure conforms to Equatable.
ja: SuccessがEquatableに準拠するそしてFailureがEquatableに準拠する時に準拠します。

source: Conforms when Success conforms to Hashable and Failure conforms to Hashable.
ja: SuccessがHashableに準拠するそしてFailureがHashableに準拠する時に準拠します。

source: Conforms when T conforms to Equatable.
ja: TがEquatableに準拠する時に準拠します。

source: Conforms when T conforms to Hashable.
ja: TがHashableに準拠する時に準拠します。

source: Conforms when Upstream conforms to Equatable and Other conforms to Equatable.
ja: UpstreamがEquatableに準拠するそしてOtherがEquatableに準拠する時に準拠します。

source: Conforms when Upstream conforms to Equatable and Upstream.Output conforms to Equatable.
ja: UpstreamがEquatableに準拠するそしてUpstream.OutputがEquatableに準拠する時に準拠します。

source: Conforms when Upstream conforms to Equatable.
ja: UpstreamがEquatableに準拠する時に準拠します。

source: Conforms when Value conforms to BidirectionalCollection and MutableCollection.
ja: ValueがBidirectionalCollectionとMutableCollectionに準拠する時に準拠します。

source: Conforms when Value conforms to Equatable.
ja: ValueがEquatableに準拠する時に準拠します。

source: Conforms when Value conforms to Hashable.
ja: ValueがHashableに準拠する時に準拠します。

source: Conforms when Value conforms to Identifiable.
ja: ValueがIdentifiableに準拠する時に準拠します。

source: Conforms when Value conforms to MutableCollection.
ja: ValueがMutableCollectionに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Decodable.
ja: WrappedがDecodableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Encodable.
ja: WrappedがEncodableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Equatable.
ja: WrappedがEquatableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Hashable.
ja: WrappedがHashableに準拠する時に準拠します。

source: Conforms when WrappedElement conforms to Decodable.
ja: WrappedElementがDecodableに準拠している時に準拠します。

source: Conforms when WrappedElement conforms to Encodable.
ja: WrappedElementがEncodableに準拠している時に準拠します。

source: Conforms when WrappedElement conforms to Equatable.
ja: WrappedElementがEquatableに準拠している時に準拠します。

source: Conforms when WrappedElement conforms to Hashable.
ja: WrappedElementがHashableに準拠している時に準拠します。

source: Consider a class called IntegerRef that wraps an integer value.
ja: IntegerRefと呼ばれるクラスを考えてください、それはある整数値をラップします。

source: Consider the following recommendations to help choose which option makes sense when adding a new data type to your app.
ja: 以下の忠告を考慮して、どちらの選択が道理にかなっているか、新しいデータ型をあなたのアプリに追加する時に選択する助けにしてください。

source: Construct a AsyncStream buffering given an Element type.
ja: 与えられたElement型をバッファするAsyncStreamを組み立てます。

source: Construct a AsyncThrowingStream buffering given an Element type.
ja: 与えられたElement型をバッファするAsyncThrowingStreamを組み立てます。

source: Construct an iterator.
ja: あるイテレータを組み立てます。

source: Consult the IEEE 754 standard for additional details.
ja: IEEE 754標準をさらなる詳細として参照してください。

source: Continuations
ja: さまざまな継続

source: Conversely, because a forward or bidirectional collection must traverse the entire collection to count the number of contained elements, accessing its count property is an O(n) operation.
ja: 反対に、前方または双方向性のコレクションはコレクション全体を辿っていくことで含まれる要素の数を数えるので、それのcountプロパティにアクセスすることはO(n)演算になります。

source: Conversion from a pointer to an integer value with the bit pattern of the pointer’s address in memory, or vice versa.
ja: あるポインタからそのポインタのもつメモリでのアドレスのビットパターンをもつ整数値への変換、またはその逆。

source: Convert Unmanaged Objects to Memory-Managed Objects
ja: 管理されないオブジェクトをメモリ管理オブジェクトに変換する

source: Converting Between Arrays and Create ML Types
ja: 配列間で変換するそしてML型を作成する

source: Converting Between Dictionaries and Create ML Types
ja: 辞書の間で変換してML型を作成する

source: Converting Between Numeric Types
ja: 数値型の間で変換する

source: Converting Floating-Point Values
ja: 浮動小数点値の変換

source: Converting Integers
ja: 整数の変換

source: Converting Pointers
ja: ポインタの変換

source: Converting Ranges
ja: 範囲を変換する

source: Converting Strings
ja: 文字列の変換

source: Converting an NSNumber to a Boolean
ja: NSNumberをブールに変換する

source: Converting with No Loss of Precision
ja: 精度の損失なしに変換する

source: Core Foundation objects returned from annotated APIs are automatically memory-managed in Swift—you don't need to invoke the CFRetain, CFRelease, or CFAutorelease functions yourself.
ja: 注釈をつけられたAPIから返されるCore Foundationオブジェクトは、自動的にSwiftにおいてメモリ管理されます ― あなたは、CFRetain、CFRelease、またはCFAutorelease関数をあなた自身で呼び出す必要はありません。

source: Create a Singleton
ja: シングルトンの作成

source: Create a new dictionary by using a dictionary literal.
ja: 新しい辞書を辞書リテラルを使って作成してください。

source: Create a new range using the closed range operator (...).
ja: 新しい範囲を完結範囲演算子（...）を使って作成します。

source: Create a slice of the absences array starting after the index found in step 1.
ja: absences配列のスライスを、手順１で見つけたインデックスの後から開始して作成します。

source: Create a slice of the absences array that holds the second half of the days.
ja: 学期後半の日付を保持する、absences配列のスライスを作成してください。

source: Create an enumeration that conforms to the Error protocol with a case for each possible error.
ja: Errorプロトコルに準拠する列挙を、各ありうるエラーに対して１つのケース節で作成してください。

source: Create instances of Bool by using one of the Boolean literals true or false, or by assigning the result of a Boolean method or operation to a variable or constant.
ja: Boolのインスタンスをブールリテラルのtrueまたはfalseのうち１つを使うことによって、またはブールのメソッドや演算の結果を変数や定数に代入することによって作成してください。

source: Create new instances of floating-point types using integer or floating-point literals.
ja: 浮動小数点型の新しいインスタンスを、整数または浮動小数点リテラルを使って作成してください。

source: Creates a Boolean from an integer wrapped in a data value.
ja: あるブールをあるデータ値の中にラップされる整数から作成します。

source: Creates a NaN (“not a number”) value with the specified payload.
ja: 指定されたペイロードをもつNaN（「非数」）値を作成します。

source: Creates a character containing the given Unicode scalar value.
ja: 与えられたユニコードスカラー値を含んでいるひとつの文字を作成します。

source: Creates a character from a single-character string.
ja: ある単一文字の文字列から１つの文字を作成します。

source: Creates a character with the specified value.
ja: 指定された値でひとつの文字を作成します。

source: Creates a checked continuation from an unsafe continuation.
ja: 検査済み継続を非安全継続から作成します。

source: Creates a collection containing the specified number of the given element.
ja: 指定された数の与えられた要素を含んでいるコレクションを作成します。

source: Creates a dictionary by merging key-value pairs in a sequence into the dictionary, using a combining closure to determine the value for duplicate keys.
ja: ある辞書を作成します、あるシーケンスの中のキー値ペアをその辞書に合併させることによってです、結合用のクロージャを使って重複キーに対する値を決定します。

source: Creates a dictionary by merging the given dictionary into this dictionary, using a combining closure to determine the value for duplicate keys.
ja: 与えられた辞書をこの辞書へと結合することによって１つの辞書を作成します、結び付けられているクロージャを使って何らかの重複キーに対して値を決定します。

source: Creates a dictionary initialized with a dictionary literal.
ja: 辞書リテラルで初期化される辞書を作成します。

source: Creates a dictionary that contains the keys and values from an attribute container, using a specified attribute scope.
ja: ある辞書を作成します、それはキーと値をある属性コンテナから含むものです、ある指定された属性スコープを使っています。

source: Creates a dictionary that contains the keys and values from an attribute container, using an attribute scope that a key path identifies.
ja: ある辞書を作成します、それはキーと値をある属性コンテナから含むものです、ある属性スコープを使っていてそれはあるキーパスを識別します。

source: Creates a double from another double wrapped in a data value.
ja: あるdoubleをデータ値の中にラップされる別のdoubleから作成します。

source: Creates a new Boolean value from the given string.
ja: 与えられた文字列から新しいブール値を作成します。

source: Creates a new array by decoding from the given decoder.
ja: 新しい配列を指定のエンコーダからエンコードすることによって作成します。

source: Creates a new array containing the specified number of a single, repeated value.
ja: 指定された数の、ある単一の値の繰り返しを含んでいる新しい配列を作成します。

source: Creates a new collection by concatenating the elements of a collection and a sequence.
ja: あるコレクションとあるシーケンスの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of a sequence and a collection.
ja: あるシーケンスとあるコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of two collections.
ja: ２つのコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection difference from a collection of changes.
ja: 新しいコレクション差異を、変更それらからなるあるコレクションから作成します。

source: Creates a new context with the given path of coding keys and a description of what went wrong.
ja: 与えられたコーディングキーのパスと何がうまくいかなかったかの説明で新しいコンテキストを作成します。

source: Creates a new contiguous array by decoding from the given decoder.
ja: 新しい隣接配列をこの与えられたデコーダから復号することによって作成します。

source: Creates a new dictionary by decoding from the given decoder.
ja: 新しい辞書を、指定のデコーダからデコードすることによって作成します。

source: Creates a new dictionary from the key-value pairs in the given sequence, using a combining closure to determine the value for any duplicate keys.
ja: 新しい辞書を、与えられたシーケンスの中のキー値ペアから作成します、結合用のクロージャを使って何らかの重複キーに対して値を決定します。

source: Creates a new dictionary from the key-value pairs in the given sequence.
ja: 新しい辞書を、与えられたシーケンスの中のキー値ペアから作成します。

source: Creates a new dictionary whose keys are the groupings returned by the given closure and whose values are arrays of the elements that returned each key.
ja: 新しい辞書を作成します、それのキーは与えられたクロージャによって返されるグループ分けです、そしてそれの値はいくらかの要素からなる配列で、それが各キーで返されるものです。

source: Creates a new floating-point value using the sign of one value and the magnitude of another.
ja: ある値の符号ともう一方の規模とを使って新しい浮動小数点値を作成します。

source: Creates a new hasher.
ja: 新しいハーシャーを作成します。

source: Creates a new index wrapping base.
ja: baseをラップしている新しいインデックスを作成します。

source: Creates a new instance by decoding from the given decoder.
ja: 与えられたデコーダからデコードすることで新しいインスタンスを作成します。

source: Creates a new instance from an interpolated string literal.
ja: 新しいインスタンスを補間文字列リテラルから作成します。

source: Creates a new instance from the bit pattern of the given instance by sign-extending or truncating to fit this type.
ja: この型に適合するように符号拡張または切り詰めることによって、指定インスタンスのビットパターンから新しいインスタンスを作成します。

source: Creates a new instance from the bit pattern of the given instance by truncating or sign-extending if needed to fit this type.
ja: もしこの型に適合するのに必要ならば切り詰めるか符号拡張によって、指定インスタンスのビットパターンから新しいインスタンスを作成します。

source: Creates a new instance from the given integer, if it can be represented exactly.
ja: 与えられた整数から新しいインスタンスを作成します、もしそれが正確に表現できるならば。

source: Creates a new instance from the given integer.
ja: 与えられた整数から新しいインスタンスを作成します。

source: Creates a new instance from the given string.
ja: 与えられた値から新しいインスタンスを作成します。

source: Creates a new instance from the given value, if it can be represented exactly.
ja: 新しいインスタンスをこの与えられた値から作成します、もしそれが正確に表現できるならば。

source: Creates a new instance from the given value, rounded to the closest possible representation.
ja: 与えられた値から新しいインスタンスを作成します、最も近い可能な表現に丸められます。

source: Creates a new instance from the specified integer.
ja: 指定された整数から新しいインスタンスを作成します。

source: Creates a new instance from the specified sign and bit patterns.
ja: 指定された符号とビットパターンから新しいインスタンスを作成します。

source: Creates a new instance initialized to the given value, if it can be represented without rounding.
ja: それが丸めなしに表されるならば、与えられた値に初期化される新しいインスタンスを作成します。

source: Creates a new instance initialized to the given value.
ja: 与えられた値に初期化される新しいインスタンスを作成します。

source: Creates a new instance of a collection containing the elements of a sequence.
ja: あるシーケンスの要素を含んでいるあるコレクションの新しいインスタンスを作成します。

source: Creates a new instance that approximates the given value.
ja: 与えられた値におおよそ相当する新しいインスタンスを作成します。

source: Creates a new instance with the given raw value.
ja: 与えられた生の値で新しいインスタンスを作成します。

source: Creates a new instance with the representable value that’s closest to the given integer.
ja: 与えられた整数に最も近い表現可能な値を使って新しいインスタンスを作成します。

source: Creates a new instance with the same memory representation as the given value.
ja: 与えられた値と同じメモリ表現で新しいインスタンスを作成します。

source: Creates a new instance with the specified raw value.
ja: 指定された生の値を持つ新しいインスタンスを作成します。

source: Creates a new integer value from the given string and radix.
ja: 与えられた文字列と基数から新しい整数値を作成します。

source: Creates a new integer value from the given string.
ja: 与えられた文字列から新しい整数値を作成します。

source: Creates a new pointer from the given address, specified as a bit pattern.
ja: 新しいポインタをこの与えられたアドレスから作成します、ビットパターンとして指定されます。

source: Creates a new pointer from the given pointer.
ja: 新しいボインタをこの与えられたポインタから作成します。

source: Creates a new sequence that wraps and forwards operations to base.
ja: baseをラップしてそれへと演算を転送する新規シーケンスを作成します。

source: Creates a new typed pointer from the given opaque pointer.
ja: 与えられた不透明ポインタから新しい型付ポインタを作成します。

source: Creates a new value equal to zero.
ja: ゼロに等しい新しい値を作成します。

source: Creates a new value from the given sign, exponent, and significand.
ja: 与えられた符号、指数、そして仮数から新しい値を作成します。

source: Creates a new value with the bit pattern of the given pointer.
ja: 与えられたポインタのビットパターンで新しい値を作成します。

source: Creates a new value with the given bit pattern.
ja: 与えられたビットパターンから新しい値を作成します。

source: Creates a new value, if the given integer can be represented exactly.
ja: 与えられた整数が正確に表現できるならば、新しい値を作成します。

source: Creates a new value, rounded to the closest possible representation.
ja: 新しい値を作成します、最も近い可能な表現へ丸められます。

source: Creates a new vector by decoding scalars from the given decoder.
ja: ある新しいベクターをこの与えられたデコーダからスカラーをデコードすることによって作成します。

source: Creates a new, empty array.
ja: 新しい、空の配列を作成します。

source: Creates a sequence of pairs built out of two underlying sequences.
ja: ２つの根底にあるシーケンスから組み立てられるペアからなるシーケンスを作成します。

source: Creates a sequence whose makeIterator() method forwards to makeUnderlyingIterator.
ja: それのmakeIterator()メソッドをmakeUnderlyingIteratorへと転送するあるシーケンスを作成します。

source: Creates a set containing the elements of the given array literal.
ja: 与えられた配列リテラルの要素を含んでいる集合を作成します。

source: Creates a string interpolation with storage pre-sized for a literal with the indicated attributes.
ja: あるリテラルに対してあらかじめサイズ指定されるストレージで、指し示される属性で、文字列補間を作成します。

source: Creates a type-erased collection that wraps the given collection.
ja: 与えられたコレクションをラップする型消去コレクションを作成します。

source: Creates a type-erased hashable value that wraps the given instance.
ja: 型消去ハッシュ可能値を作成します、それは与えられたインスタンスをラップします。

source: Creates a value initialized to zero.
ja: ゼロに初期化される値を作成します。

source: Creates a vector from the specified elements.
ja: あるベクターをこの指定された要素それらから作成します。

source: Creates a vector with zero in all lanes.
ja: あるベクターを全レーンにおいてゼロで作成します

source: Creates an AnyBidirectionalCollection having the same underlying collection as other.
ja: AnyBidirectionalCollectionを作成します、otherと同じ基礎をなすコレクションを持っています。

source: Creates an AnyCollection having the same underlying collection as other.
ja: AnyCollectionを作成します、otherと同じ基礎をなすコレクションを持っています。

source: Creates an AnyRandomAccessCollection having the same underlying collection as other.
ja: AnyRandomAccessCollectionを作成します、otherと同じ基盤コレクションを持っています。
